app/controllers/products_controller.rb

  def create
    Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["price", 3], ["created_at", "2019-02-15 06:40:09.739147"], ["updated_at", "2019-02-15 06:40:09.739147"], ["inventory", 12], ["description", "This is a great thing"]]